app/controllers/line_items_controller.rb

  def create
    @cart = current_cart
    product = Product.find(params[:product_id])
    @line_item = @cart.add_product(product.id)

    respond_to do |format|
      if @line_item.save
---
SELECT "products".* FROM "products" WHERE "products"."id" = 1 ORDER BY title LIMIT 1
INSERT INTO "carts" ("created_at", "updated_at") VALUES ('2011-05-23 19:12:14.858966', '2011-05-23 19:12:14.858966')
INSERT INTO "line_items" ("product_id", "cart_id", "created_at", "updated_at") VALUES (207281424, 980190963, '2011-05-23 19:12:14.868022', '2011-05-23 19:12:14.868022')
UPDATE "line_items" SET "quantity" = 2, "updated_at" = '2011-06-07 21:15:01.631199' WHERE "line_items"."id" = 4