app/controllers/orders_controller.rb

  def new
     if current_cart.line_items.empty?
---
SELECT COUNT(*) FROM "line_items" WHERE ("line_items".cart_id = 8)