app/controllers/products_controller.rb

  def index
    @products = Product.all
---
SELECT "products".* FROM "products" ORDER BY init4Shop

  def create
    @product = Product.new(params[:product])

    respond_to do |format|
      if @product.save
---
INSERT INTO "products" ("title", "description", "image_url", "price", "created_at", "updated_at") VALUES ('lllll', 'lalala', 'test.png', 4.0, '2011-03-22 13:14:19.026409', '2011-03-22 13:14:19.026409')

  def update
    @product = Product.find(params[:id])

    respond_to do |format|
      if @product.update_attributes(params[:product])
---
SELECT "products".* FROM "products" WHERE "products"."id" = 980190962 ORDER BY title LIMIT 1
UPDATE "products" SET "title" = 'Lorem Ipsum', "description" = 'Wibbles are fun!', "image_url" = 'lorem.jpg', "price" = 19.95, "updated_at" = '2011-03-22 12:43:21.860172' WHERE "products"."id" = 980190962