app/controllers/store_controller.rb

SELECT "products".* FROM "products" ORDER BY init4Shop
---
    def index
          @products = Product.all